In [1]:
# Imporring important Libraries

import pandas as pd
import numpy as np

In [2]:
# Loading dataset using pandas

df = pd.read_csv('train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [3]:
# checking available dataset rows and columns

df.shape

(891, 12)

In [4]:
# checking null value in dataset

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
# Filling available null value in dataset

df.Age.fillna(df.Age.mean(), inplace=True)
df.Fare.fillna(df.Fare.mean(), inplace=True)
df.Age.isnull().sum()

0

In [6]:
# Creating new dataset with important features

df2 = df[['Pclass','Sex','Age','Fare']]
df2.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [7]:
# Creating dummy dataset for categorical column using 'pd.get_dummies' and dropping category column.

dummies_Sex = pd.get_dummies(df2.Sex, prefix='Gender')
new_dataset = pd.concat([dummies_Sex, df2], axis='columns') 
new_dataset.drop('Sex', axis='columns', inplace=True)
new_dataset.head()

   Gender_female  Gender_male  Pclass   Age     Fare
0              0            1       3  22.0   7.2500
1              1            0       1  38.0  71.2833
2              1            0       3  26.0   7.9250
3              1            0       1  35.0  53.1000
4              0            1       3  35.0   8.0500

In [8]:
# Converting Age column in integer as it's in floating value

new_dataset.Age = new_dataset[['Age']].astype('int64')
new_dataset.Age

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    29
889    26
890    32
Name: Age, Length: 891, dtype: int64

In [9]:
# Separating features (X) and label (y) and then printing Features (X).

X = new_dataset.iloc[:,:]
y = df['Survived']
X

     Gender_female  Gender_male  Pclass  Age     Fare
0                0            1       3   22   7.2500
1                1            0       1   38  71.2833
2                1            0       3   26   7.9250
3                1            0       1   35  53.1000
4                0            1       3   35   8.0500
..             ...          ...     ...  ...      ...
886              0            1       2   27  13.0000
887              1            0       1   19  30.0000
888              1            0       3   29  23.4500
889              0            1       1   26  30.0000
890              0            1       3   32   7.7500

[891 rows x 5 columns]

In [10]:
# Printing label (y)

y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [11]:
# Importing 'test_train_split' library from sklearn and dividing data into training and testing part.

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [12]:
# Importing 'Decision Tree' from sklearn.

from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

In [13]:
# Creating a Model in Decision Tree and then fitting it.

model = DecisionTreeClassifier()
model.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [14]:
# Checking the accuracy score on Test Data.

model.score(X_test, y_test)

0.8044692737430168